# WireMaxSizeNonexistent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..WireMaxSizeNonexistent Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot find max size in current wire type's material table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WireMaxSizeNonexistent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WireMaxSizeNonexistent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WireMaxSizeNonexistent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace